tutorials/incompressible/porousSimpleFoam/beaverJoseph/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       7860;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       7900;
    }
    upperWall
    {
        type            wall;
        nFaces          100;
        startFace       7940;
    }
    lowerWall
    {
        type            wall;
        nFaces          100;
        startFace       8040;
    }
    frontAndBack
    {
        type            empty;
        nFaces          8000;
        startFace       8140;
    }
)

// ************************************************************************* //
